_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        (None, 150, 150, 3)       0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 150, 150, 32)      896       
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 75, 75, 32)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 75, 75, 64)        18496     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 37, 37, 64)        0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 37, 37, 64)        36928     
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 18, 18, 64)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 18, 18, 128)       73856     
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 9, 9, 128)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 10368)             0         
_________________________________________________________________
dense_13 (Dense)             (None, 64)                663616    
_________________________________________________________________
dense_14 (Dense)             (None, 1)                 65        
=================================================================
Total params: 793,857
Trainable params: 793,857
Non-trainable params: 0
_________________________________________________________________
